cases/aspiration/0.org/M
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      M;
}

dimensions      [-1 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            sectionalConstant;
        value           $internalField;
    }

    outletFlow
    {
        type            zeroGradient;
    }

    outletProbe
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    wedgeFront
    {
        type            wedge;
    }

    wedgeBack
    {
        type            wedge;
    }

    axis
    {
        type            symmetryPlane;
    }

    wallProbe
    {
        type            zeroGradient;
    }
}
