cases/aspiration/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 2;

method             scotch;

simpleCoeffs
{
    n              (2 1 1);
    delta          1E-3;
}
